'''
Даны два числа. Выведите их сумму.

Формат ввода
Программа на вход получает два целых числа, по одному на каждой строке.

Формат вывода
Выведите сумму чисел


'''

a = int(input())
b = int(input())
print(a + b)
